app/Http/Controllers/ChannelController.php

    public function index()
    {
        $channels = Channel::all();
---
select * from `channels`